/*
* Объявить класс Vec2 для представления двумерного вектора с приватными полями a, b – значения элементов вектора.
* Прописать конструктор(ы), сеттер(ы) и геттер(ы) для записи и считывания данных вектора.
* Нужно обеспечить, чтобы значения элементов вектора находились в диапазоне [-MAX_VAL; MAX_VAL],
* где MAX_VAL – константа, заданная в этом же классе. Добавить в класс Vec2 еще два метода:
* для вычисления суммы и разности двух векторов класса Vec2.
* Эти методы не должны менять значений векторов, участвующих в операциях сложения и вычитания, а создавать новый с соответствующими значениями.
*/
package practice.task30;

public class Vec2 {}
